{"url":"http://www.amazon.com/Chefn-Strawberry-Slicester-Hand-Held-Slicer/dp/B002XOHZYU/ref=pd_sbs_79_2/190-8453876-6801002?ie=UTF8&dpID=31LXsBc0ERL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=0CXKKB06CR1YHRQYVG6N","name":"00_22_99","review":"This is an excellent strawberry slicer that works on all size strawberries except for the very large.  Just insert the strawberry point side down into the cutting chamber and squeeze out uniform slices of a little more than 1/8\" thick. It's perfect for using evenly sliced strawberries as a garnish on desserts, salads, or cereals.What I really love about this is that I can use my Nesco American Harvest FD-1018P 1000 Watt Food Dehydrator Kit on 135 degrees for 2-1/2 to 3 hours and the sliced strawberries will be perfectly dehydrated.The unit cleans pretty easily by rinsing off under a heavy stream of water.  However, be careful when cleaning this slicer.  I cut my finger when I stupidly tried to remove a strawberry seed stuck on the inside blade.  I should have used an object such as a knife to remove the seed as the inside blades are VERY SHARP.  As a result of this and the fact that the unit stores open, I advise not letting children play around this slicer as one can get very hurt if they put their finger inside and squeeze.I took off one star on this slicer for the following reasons:- The slicer doesn't slice very large strawberries (you have to cut them in half first).- The handles have to be compressed with some power to extract a strawberry so someone with poor hand strength or elderly might have a problem with this slicer.- There is no locking mechanism to lock the handle together for easier storage; instead the unit stores in the open position.Overall, I highly recommend this strawberry slicer especially for dehydrating equally sliced strawberries.  The package also states you can slice mushrooms but I didn't try that.","upvotes":0,"downvotes":0,"productTitle":"Chef'n Strawberry Slicester Hand-Held Strawberry Slicer","imageUrl":"http://ecx.images-amazon.com/images/I/31LXsBc0ERL._AC_UL160_SR160,160_.jpg"}