{"url":"http://www.amazon.com/Chefn-102-138-005-StemGem-Strawberry-Huller/dp/B002XOHZWC/ref=pd_sbs_79_1/190-8453876-6801002?ie=UTF8&dpID=41TL1TBYz1L&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=0CXKKB06CR1YHRQYVG6N","name":"00_23_66","review":"I could tell when strawberry season was starting by the knot developing in the pit of my stomach. I dreaded what came next, the little green baskets filled with strawberries stacked on each other like animals.It was bad enough that they were picked before they had a chance to fully develop, to grow, to ripen!I knew how they felt...their seedy skin bruised by a clumsy truck driver who was too busy texting to avoid a pothole, or the errant assistant produce manager mindlessly throwing these baskets full of ruby jewels of nature up on a display shelf and dropping them on the unforgiving concrete floor. A mindless mother slapping them endlessly for something they didn't do.There is nothing more shocking to me than consumers who take the time to bathe these beauties properly, then deciding to torture them! Ripping out their stems by the roots, or twisting them like some sort of fleshy wind up toy; each twist making the berry scream even louder! Yes, berries feel pain, and I am cursed with the ability to hear their pain. I hear berry screams. It is worse than the sound a mother makes when she screams at her teenager to stop wetting the bed. Cutting off the stems does not help, as that is tantamount to scalping a man alive, except the Native Americans did not eat the man they scalped.I moved to the Midwest to avoid getting any fresh berries, and that seemed to help a bit, but I always prayed for a better solution to killing my berry brethren, and Chef'n StemGem was born.The StemGem's blade cuts through the top if the berry's head, as easy as an icepick through a cerebellum. Berry death is achieved quickly, and humanely. I can tell you the berries feel nervous when you first bring them home, but when they see the StemGem coming for them they believe it is a berry buddy, due to the fact that the StemGem looks just like one of them. A Chef'n brilliant idea. It looks so real, that when I first laid eyes on the contraption, I started to strangle my therapist who showed it to me. I thought he was going to force-feed me strawberries for a week like my mother did back in March of '82. When he kicked me off of him, regained his color and explained to me what the device truly was, I went to hug him. I was stopped by security, who had already arrived and shot me with three taser blasts because they thought I was trying to hurt him again. Idiots.I highly recommend the StemGem, I only wish I could have one in my current accommodations, but hey, it saved me from getting life!","upvotes":0,"downvotes":0,"productTitle":"Chef'n StemGem Strawberry Huller","imageUrl":"http://ecx.images-amazon.com/images/I/41TL1TBYz1L._AC_UL160_SR160,160_.jpg"}