{"url":"http://www.amazon.com/Pack-Hutzler-Banana-Slicer-571b/dp/B00BXVWW8I/ref=pd_sbs_79_1/190-8453876-6801002?ie=UTF8&dpID=41Fglyb6IwL&dpSrc=sims&preST=_AC_UL160_SR141%2C160_&refRID=1MAVNJZ85XQZSB88MV6E","name":"00_29_63","review":"Before finding the Hutzler 571 banana slicer my life was in shambles.  Day after day I would come to work with my whole banana.  My colleagues would snicker while watching me eat saying things like “oh yeah, you eat that banana” and “bet you can’t fit that whole banana in your mouth.” Being the competitor that I am, I always did, proving them wrong. After shoving an entire banana in my mouth for the fifth time that week I knew something had to change. I would’ve gladly sliced the banana but never had the time or steady hands, and due to my aichmophobia (fear of sharp pointy objects) I was unable to use a knife to cut the banana.The one time I tried to cut my banana was disastrous. I woke up five hours earlier than usual in order to prepare for the task at hand. Placing the banana on the counter I began thinking of ways to slice it. I decided to go with a spoon…BIG MISTAKE! After hours of meticulously slicing away, I was finally finished. The result was horrific. Each slice was curved and a different size than the other. Now running late for work I quickly threw my banana chunks in a Tupperware and left.When I arrived at my cubicle I tried eating my banana as discretely as possible. It didn’t work. My co-worker David saw me eating and all hell broke loose. “Hey guys come have a look at this!” Everyone rushed over and instantly broke out into laughter upon the sight of my hideous banana chunks. One person shouted “who cut that banana a four year old?!” while another said “bet you can’t fit all those chunks in your mouth.” I quickly shoved the remaining pieces in my mouth and ran for the bathroom.While contemplating if I would ever eat a banana again, I started looking up funny amazon reviews to help cheer me up. While reading, I stumbled across the Hutzler 571 banana slicer. While others mocked it not noticing its significance, I realized my banana eating days were not over. Quickly ordering the two-pack I waited for it to arrive, knowing the humiliation would soon be over.When it finally arrived I quickly grabbed a banana, peeled it, and used my Hutzler 571 banana slicer. The results were astonishing. Each slice came out perfectly. I couldn’t have been more pleased, and was more than excited to show off my amazingly symmetrical banana slices at the office. The next day was the beginning of a whole new work environment. I proudly opened my Tupperware revealing the greatness I had created. While eating I heard a gasp and someone say “that is the most beautifully sliced banana I’ve ever seen.” My confidence was restored.Because of the Hutzler 571. I can proudly eat my bananas wherever I please without the fear of being made fun of. This has made me more confident and because of that I am now looking at a promotion. So while you sit back and make fun of this product, just know the Hutzler 571 banana slicer saved my life.","upvotes":0,"downvotes":0,"productTitle":"2 Pack Hutzler 571 Banana Slicer 571b","imageUrl":"http://ecx.images-amazon.com/images/I/41Fglyb6IwL._AC_UL160_SR141,160_.jpg"}