{"url":"http://www.amazon.com/Chefn-102-138-005-StemGem-Strawberry-Huller/dp/B002XOHZWC/ref=pd_sbs_79_1/190-8453876-6801002?ie=UTF8&dpID=41TL1TBYz1L&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=0CXKKB06CR1YHRQYVG6N","name":"00_23_42","review":"After reading all the glowing reviews I purchased one of these from Amazon. I must say, I was looking forward to using this incredible little kitchen tool since I was preparing Strawberry Pies for Easter which required hulling of 8 pounds of strawberries. Well, the device arrived and I proceeded to use it as shown in the videos.I only made it through 2 lbs. of strawberries before I said to myself, \"are you kidding me\"? First off you are required to apply force to open the \"jaws\" of this contraption and then push it into the strawberry through the pedunkle (yes folks, this is what the stem is referred to) and into the pith in order to remove the hull. The problems were as follows: 1.) the jaws open very narrowly and since you are to push into the berry, the curve of the jaws forces them to close so you have to apply some pressure. If you have ripe berries, good luck keeping them from being crushed. 2.) The jaws are not sharp enough to penetrate the pendunkle leaves; same problem as the 1st issue in regard to crushing or attempting to create a deep cavity for stuffing. 3.) While the device provides slip resistance when wet, the shape lacks the ability to provide a natural grip.Now, being totally frustrated, I made a emergency trip to Bed Bath and Beyond to see what they had and SUCCESS! They had a OXO Good Grips Strawberry Huller like this:http://www.amazon.com/OXO-Good-Grips-Strawberry-Huller/dp/B00I3W2RJO/ref=sr_1_2?ie=UTF8&qid=1398340986&sr=8-2&keywords=OXO+Good+Grips+Strawberrywhich you can find, here, on Amazon. While this is just a little more expensive than my initial purchase here, it is head and shoulder above in speed and results. You can easily hull any type of berry, no matter how ripe, in a very quick simple motion and the huller does most of the work. The blades easily cut through the pedunkle and, with a quarter twist and pull, the hull is removed. You depress the plunger and the hull is ejected. No springs here and the only force required is pushing the blades into the berry and lightly depressing the plunger once the hull is removed.I finished off the last 6 pounds in just a little over the time it took me to do the first 2 pounds with this device. You are also left with a berry that is better suited for stuffing if that is what you intend to do. Buy one of these and check it out for yourselves!Happy hulling this strawberry season!","upvotes":0,"downvotes":0,"productTitle":"Chef'n StemGem Strawberry Huller","imageUrl":"http://ecx.images-amazon.com/images/I/41TL1TBYz1L._AC_UL160_SR160,160_.jpg"}