{"url":"http://www.amazon.com/Joie-Simply-Slice-Strawberry-Slicer/dp/B002451AB2/ref=pd_sbs_79_6/190-8453876-6801002?ie=UTF8&dpID=41ejvDkkEBL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1MAVNJZ85XQZSB88MV6E","name":"00_24_62","review":"I used to use any manner of objects to slice strawberries...other than a knife.  If you'll read my banana slicer review, you'll understand that such weaponry isn't allowed to me as per terms of my probation.Items I've used:1.  Karate - this worked well enough for the really huge strawberries...but rather than coming up with sliced berries, I'd say they were more like halved berries.  It also gave me sweet, juicy, red hands as karate chops are similar to blunt force trauma if you're a strawberry...not a very clean cut at all.b.  Paper - I figured if paper can cut a finger, it should sure as hell be able to handle a damn strawberry.  Well...all of those tiny seeds act as a sort of strawberry armor and the paper dulled immediately.  Also, on occassions I was able to avoid any seeds, the paper would become soggy and I'd have paper goop in my berry bowl when all was said and done.  Sure, that's extra fiber for one's diet, but personally, I'm very, VERY regular without it.III.  Hammer - I do not recommend using hammers to slice strawberries.  I've tried multiple sizes and styles and had the following results...- ballpeen hammer - the smaller size of the striking portion of a ballpeen hammer seemed like a legit option on larger berries.  I ended up smashing a hole in the center of the berry and ended up with what one might describe as a donut-looking strawberry and quite a mess.  A lot of the berry was turned into mush.-  Rubber Mallet - this s*** didn't work at all, unless you like your sliced strawberries on the really pulpy and juicy side.-  Sledgehammer - this bad boy could slice a bunch of berries at one time, but the results were a larger mess than the rubber mallet.-  Jackhammer - these things aren't exactly cheap or easy to come by.  It took a lot of practice to finesse perfect strawberry slices with one of these, but I did it.  I had to sharpen the end with a nail file which took a few months and honestly the noise complaints from neighbors almost landed me back in the slammer.4.  Shot the strawberries with a gun...it was a pellet gun so my parole officer didn't send me back up the river.  I had to shoot very precisely to get sliced berries and I feel that the average of 5 shots per berry was just too labor intensive.  It also seemed to waste a good amount of the fruit and life-giving vitamins it provides.So when I stumbled upon this thing for a buck, I was ecstatic!  This things slices and dices, except it doesn't dice.  There's absolutely no frustration with slicing strawberries anymore.  I did only give it three stars because it's pretty crappy at slicing boysenberries or lingonberries.  It really only works on strawberries.","upvotes":0,"downvotes":0,"productTitle":"Joie Simply Slice Strawberry Slicer","imageUrl":"http://ecx.images-amazon.com/images/I/41ejvDkkEBL._AC_UL160_SR160,160_.jpg"}