{"url":"http://www.amazon.com/dp/B0047E0EII","name":"00_30_58","review":"It's was a night like every other.  Too many cigarettes and not enough work.  Clients were as rare as hens teeth, these days.  It seemed word got out that I was getting sloppy. \"Mr banana fingers\", they called me behind my back.  \"He's losing his touch\", they'ed whisper.  But when you've sliced as many as i have you'd get soft too.  Fat chance I was retiring now. Not with a '57 convertible half way paid off and a tab at the banana stand on 4th that was well past its shelf life. I was a one punch palooka half way to loserville, smelling like cheap cologne and broken dreams.But then she walked in.  She was a knock out.  the kind of girl that made old men suck in their gut and young men puff out their chest.  \"We'll hello there sweetheart, the dentist office is next door\", I said with a smile.\"I'm not looking for the dentist\", she said.  \"I'm looking for Johnny Flynn Private Slicer.\"\"We'll you came to the right place\", I said, mustering up what I hoped was a look of confidence.  \"Tell me what's on your mind.\"The story she told would have turned the most jaded slicer green with banana envy.  It was a big job.  The biggest. And even though my gut was turning summersaults I knew I couldn't turn it down.  This was the kind of slicing gig that would make a hundred reputations or destroy a thousand more.Her father was the head of the Dole banana conglomerate and some Ivy League poindexter came up with the big idea to do the annual customer gala with a casino night theme.  But this time they were gunna use banana chips instead of poker chips.  These babies had to be stripped, sliced and dried to exact measurements if they were going to be handled by Dole's biggest clients.\"I heard you're the best\", she said.\"Was the best\", I thought.  \"Yeah, I've still got the chops. Watch this. I grabbed my number 7 knife and threw a banana in the air. I swung at it and missed it entirely.  My knife stabbed down through nothin' but air and dropped out of my hand on the table in front of me.  I watched the banana spin slowly as it fell fell fell and slap, like some miracle you read about in those dime store slicer mags, the banana landed on the knife blade and was cut cleanly in two.  My jaw dropped open in amazement and my eyes were big as saucers.\"Impressive\", she said.\"Impossible\", I thought.  \"Yep, impressive is my middle name.\", I stammered.She tossed her red hair back and said, \"You got the job. See you Saturday at eight.\"\"B... Buh... but, we haven't talked about my fee.She laughed and said as she walked to the door, \"Whatever your usual fee is, I'll pay triple.\"Then she added, \"Oh, and if you blow this gig you'll never work in this town again.\"And with a slam of the door she was gone.  I realized then she hadn't told me her name. That didn't matter.  Everyone knew who she was. It was splashed across the society pages every week.  \"Dole diva doles out dollars to the down and despondent\" or \"Lecherous love lorn Lothario leaves Linda Livingston livid\".  L. & L. but friends just called her Elle.\"You'll never work in this town again\".Those words echoed over and over in my head.  As I reached for my hat my hand was shaking.  But then, I looked down at the table and saw the miracle banana perfectly sliced.... an accident, or was it?  Maybe the big guy up stairs was gunna save my sorry heiner once again.  I said a quick thanks to my guardian slicer and headed home.  Once I got in bed doubt crashed into my head like a 500 lb gorilla on a sack of Dole's finest.  I wasn't gunna come out of this.  Not ol' Banana Fingers.  I needed help fast and I knew just where to get it.  Johnny Flynns mentor in this business was a crusty old slicer named Harvey Muldoon.  Long retired he learned the trade over seas cooking banana fritters and stew for the yanks during WWI.  If anyone could help me pull this off it was him.  I know it was late but I went over and told him everything--about the dame, the gig and the banana trick.  He sat their stone faced until I told him about the banana flip, miss and slice.  If it wasn't so late in the evening I would swear he shed a tiny tear.  He got up from his chair and stood there. And with a smile he said, \"I guess you're going to be needing this.\"  He dragged the paint chipped chair over to the corner of the room, got up on it.  Reaching up to the ceiling he pushed at a plank which moved out of the way.  He reached into the ceiling compartment and pulled out a box wrapped in an old World War I army issue banana sack.  Inside was a battered tin box.  With a look of immense pride he handed it to me like a father handing someone their new born to hold for the first time.  \"This saved my life\", he said as he carefully lifted the dented metal lid.  Inside was a hand cut form made of velvet and soft cotton and nestled in the middle was a strange looking device. Reverently he took it out and handed it to me.  \"Be careful now.  It's razor sharp.\"\"What is it\" I said.It's the Hutzler 571.  It's what gave me the speed and precision to feed thousands of doughboys a day with mess tins and steaming bowls of banana fritters, pudding and stew.I was intrigued but skeptical... until I saw it in action.  Shazam! It sliced bananas faster than Ricky Ricardo could smack a conga drum.\"I will take good care of it\", I said solemnly.\"You better. It's yours now.\", he said.I was overwhelmed. \"I don't know what to say.\"\"You can start with a simple thank you\" he said with a smirk.Come Saturday I was all ready.  I made a small leather holster for it so that I could pull it out at a moments notice.  I practiced my draw in front of the mirror day and night.  I can't say that the event went perfectly.  But I got the satisfaction of Elle saying I could slice her bananas any old time of the year.I found my confidence that day.  Thanks to some divine help and an old man's secret weapon I made it to the big banana leagues.  No more scraping around for the odd job. Now I named my fee and sliced my way across the banana circuit.  But still, with my fame and banana jet set status Linda Livingston was still out of my league.  Now when I read about her in the society section I save the article and place them in a folder in the large steel safe along with a battered tin box. When I see it I say a quick thanks to her for walking into my life and giving this old flatfoot a chance to start again.","upvotes":0,"downvotes":0,"productTitle":"Hutzler 571 Banana Slicer","imageUrl":"http://ecx.images-amazon.com/images/I/31VTJj4VuVL._SY300_QL70_.jpg"}