{"url":"http://www.amazon.com/dp/B003G4IM4S","name":"08_30_34","review":"I spotted this after viewing some fun items like Uranium Ore and Canned Unicorn Meat. After hearing just how much fun people have with a horse mask, I knew I had to have one! Especially after I searched the web and found a picture of a guy wearing this with hooded jacket...that was especially freaky!I got this one (alas, only available at outside sites right now) because it seems to be the most realistic looking, plus has that all-important disturbing feel.1.  Heavy duty materials.2.  Has a slit up the back for easy donning and removal. Slit is barely visible as there's \"mane hair\" on both sides of it.  Image of this added.3.  How do you see? Through the horse's mouth and the nose holes. Nothing mars the look of those creepy eyes! It is easy to see out while wearing.4.  Has a \"real\" bushy hair mane. I had to look closely at the other parts because I could have sworn it had a fine dusting of hair all over. No, it's just extremely realistic looking!I already used it on the dogs.  The big one knew it was a joke, but the little one kept backing off and I chased her around the house!Come October, I may get the Mesh Easy Feeder, fill it with large treats like Twinkies, and wear them around together. That feed bag seems to be the vest priced for that purpose.edit: Have had the mask < 1 week.  Scared the hubby while he was in the shower (he didn't know I had it). The big dog thinks it's funny. The small dog is creeped out by it. She goes on the attack if hubby puts the mask on his hand, moves the mouth open and shut, and corners her! Scared the nurses and therapist at work. Then put on a hospital gown and the mask, sat in an exam room - nurse brought my boss in.  She told him a patient was being a \"horse's ass\" and demanded to see whoever was in charge. Scared the lady at the diet center. Knocked on my ex's door with it on. \"I'm Heeeeeere to pick up my son!\" This mask is worth every dollar!Edit: 2013.....I don't know what happened to all the customer photos.  :(  I had a new one. I wore the mask to the dentist's office and they laughed their butts off! I was sitting in the chair wearing the mask when the dentist came in. She got such a kick out of it that she took pictures of her looking in my mouth. Then she went to her office and gave me a real horse tooth given her by a horse vet friend. Priceless!","upvotes":0,"downvotes":0,"productTitle":"Accoutrements Horse Head Mask","imageUrl":"http://ecx.images-amazon.com/images/I/51NhtW9exnL._SX300_QL70_.jpg"}