{"url":"http://www.amazon.com/dp/B005MR3IVO","name":"15_30_49","review":"Deciding on the right time to buy your 55 gallon barrel of lube can be a big decision. You need to weigh the advantages and disadvantages carefully and I hope this helps you do so.Pros:-Great for RVing, family outings, camping, fishing, hiking, anonymous truckstop mens room encounters, visiting petting zoos in New Zealand, bypassing TATV on your jump from DADV to QAQV, sliding across a room in a comically relaxed pose, drowning your friend after she proclaims \"I LUUUV Michael Buble,\" getting to 5th base unnoticed, pregaming for dinner at Texas Roadhouse, cramming juuuust ooooone more of any object into any container/orifice/tunnel/doorway/sweatshop/vehicle/fjord.-Enough lube to get through 16 terabytes of porn and then some.-Competitive price per application.-Being water based and unscented trims clean up time from days to hours.-Gives you another argument when you want to bogey the number two hole but your girlfriend doesn't want you to. e.g. \"You know, sweetums...we did just receive a moderate amount of lube from Amazon; I'd hate for it to go to waste.\"-Real Doll compatible.-Approved for use at senior home activity day.Cons:-On the cosmological scale this is still a pretty small volume of lube. (It's only two or three orders of magnitude larger than a pedestrian lube container.) By contrast, the volume of the planet Mercury can hold 300 quintillion times more lube than this. Mercury is our smallest planet, mind you.-Colloquially known as \"The Cosby Can.\"-Not allowed on commercial airliners.-Not much of a secondhand market if you later decide you don't need this.-When people come over they might give you weird looks and ask \"why the hell do you have a 55 gallon barrel of lube?\" before promptly running out of your house.","upvotes":0,"downvotes":0,"productTitle":"Passion Lubes, Natural Water-Based Lubricant, 55 Gallon Drum","imageUrl":"http://ecx.images-amazon.com/images/I/41KQvoSmMhL._SY300_QL70_.jpg"}