{"url":"http://www.amazon.com/dp/B000EVQWKC","name":"16_30_70","review":"Oh man...words cannot express what happened to me after eating these.  The Gummi Bear \"Cleanse\". If you are someone that can tolerate the sugar substitute, enjoy.  If you are like the dozens of people that tried my order, RUN!First of all, for taste I would rate these a 5.  So good.  Soft, true-to-taste fruit flavors like the sugar variety...I was a happy camper.BUT (or should I say BUTT), not long after eating about 20 of these all hell broke loose.  I had a gastrointestinal experience like nothing I've ever imagined.  Cramps, sweating, bloating beyond my worst nightmare.  I've had food poisoning from some bad shellfish and that was almost like a skip in the park compared to what was going on inside me.Then came the, uh, flatulence.  Heavens to Murgatroyd, the sounds, like trumpets calling the demons back to Hell...the stench, like 1,000 rotten corpses vomited.  I couldn't stand to stay in one room for fear of succumbing to my own odors.But wait; there's more.  What came out of me felt like someone tried to funnel Niagara Falls through a coffee straw.  I swear my sphincters were screaming.  It felt like my delicate starfish was a gaping maw projectile vomiting a torrential flood of toxic waste.  100% liquid.  Flammable liquid.  NAPALM.  It was actually a bit humorous (for a nanosecond)as it was just beyond anything I could imagine possible.AND IT WENT ON FOR HOURS.I felt violated when it was over, which I think might have been sometime in the early morning of the next day.  There was stuff coming out of me that I ate at my wedding in 2005.I had FIVE POUNDS of these innocent-looking delicious-tasting HELLBEARS so I told a friend about what happened to me, thinking it HAD to be some type of sensitivity I had to the sugar substitute, and in spite of my warnings and graphic descriptions, she decided to take her chances and take them off my hands.Silly woman.  All of the same for her, and a phone call from her while on the toilet (because you kinda end up living in the bathroom for a spell) telling me she really wished she would have listened.  I think she was crying.Her sister was skeptical and suspected that we were exaggerating.  She took them to work, since there was still 99% of a 5 pound bag left.  She works for a construction company, where there are builders, roofers, house painters, landscapers, etc.  Lots of people who generally have limited access to toilets on a given day.  I can't imagine where all of those poor men (and women) pooped that day.  I keep envisioning men on roofs, crossing their legs and trying to decide if they can make it down the ladder, or if they should just jump.If you order these, best of luck to you.  And please, don't post a video review during the aftershocks.PS:  When I ordered these, the warnings and disclaimers and legalese were NOT posted.  I'm not a moron.  Also, not sure why so many people assume I'm a man.  I am a woman.  We poop too.  Of course, our poop sparkles and smells like a walk in a meadow of wildflowers.  Thanks for all the great comments.  I've been enjoying reading them and so glad that the horror show I experienced from snacking on these has at least made some people smile.","upvotes":0,"downvotes":0,"productTitle":"Haribo Sugar Free Gummy Bears 5LB Bag","imageUrl":"http://ecx.images-amazon.com/images/I/51kOw7BMWeL._SY300_QL70_.jpg"}