{"url":"http://www.amazon.com/dp/B000EVQWKC","name":"16_30_16","review":"My adventure, like many of the others here began with my disbelief that these incredibly descriptive reviews were true. I am here to tell you that I was wrong. It came as delivered. So here's my story...Likening myself to someone who his genetically superior to others, I ate 100 of these little colon wrenching gummies. As a side note: I recommend anyone attempting this to not start at 11pm at night. I did and sorely regret it.After taking 100 of them, I got into some basketball shorts, set some water bottles in the bathroom (to stay hydrated) as well as my ipad and settled down on the couch. My girlfriend watched me in utter disbelief as she rolled her eyes at my stupidity, while reading some of the more colorful reviews.45 minutes into it, I was disappointed. Not even so much as a grumble in my stomach. Thinking I had in fact triumphed over these havoc wreaking little demons, I took 30 more. In hindsight, I definitely jumped the gun on that one.Then, a little gas began and the gurgling commenced. The first trip to the bathroom wasn't so bad. After having a normal bowel movement I was thinking the rumbling was from the fish I had for dinner (also a mistake). I laughed at what must have been my superior genetic composition conquering these weak little candies.Not wanting to be outdone, those little b@stards turned up the heat. The second trip was NOT pleasant. The feeling was a combination between warm bathwater and volcanic lava being forcefully ejected from my rear. I was no longer laughing.For the rest of the night, I was making countless trips to the bathroom with the same results. I didn't even want to play the flight simulator app on my ipad (I always play it while on the john) it hurt so bad.But the gummies weren't done with me. After anything with color had passed through my bowels, they began dumping what I could only assume was water through my rear just to spite me for not believing they were now in control of everything in my stomach. Genetically superior, I think not.After spending all night running (not walking by any means) to the bathroom I was more than exhausted. I wanted to sleep, thinking that after the 8th round of gummy hell, I was done. Wrong again, Johnny. The second wave of increasingly painful attacks began.I was beginning to get accustomed to the gaseous, explosive passings that these gummies were causing, but my rear wasn't. It wanted to throw in the towel at round 10 and it sent me a VERY clear and VERY painful message. It wanted no more in my painful experiment. Unfortunately, the gummies did not relent.After 17 rounds of this gummy created havoc, I can only thing that my ravaged body had some sort of internal, natural disaster. Most likely a wildfire, if I had to guess. Speaking of natural disasters, the toilet which took the brunt of the gummy hell-storm appeared to be violated in indescribable ways.","upvotes":0,"downvotes":0,"productTitle":"Haribo Sugar Free Gummy Bears 5LB Bag","imageUrl":"http://ecx.images-amazon.com/images/I/51kOw7BMWeL._SY300_QL70_.jpg"}