{"url":"http://www.amazon.com/dp/B000EVQWKC","name":"16_30_34","review":"I brought two bags of these to my son's school for their Harvest party because of the new sugar free and healthy eating initiatives. All appeared well. The kids were thrilled to have something that wasn't carrot sticks or clementine pumpkins. Within a few minutes the munchkins had polished off the first bag and were tearing into the second.We started bobbing for apples and playing haunted house bingo. Twenty minutes later the kid in the purple monster costume started growling. It turns out it wasn't his voice, but his stomach.  The teacher asked my son to walk the child down to the bathroom, so I followed them into the hall.  The child's zipper appeared to be stuck and could not be budged. Suddenly the floodgates opened and hot gravy began pooling around the monster's shoes.I told my son to get help. As he turned around to head back into the classroom, he slipped in the sludge, ironically soiling his Winnie the Pooh costume.  Meanwhile, two more afflicted children were on their way to the restroom and tripped over my son in their panicked pace.As soon as Elsa smelled the putrid fumes, she began to vomit in Rapunzels hair. At this point another parent rushed into the hallway with a desperate Minion. She took one despicable look at our situation and ran back into the room.I followed them in an effort to recruit assistance. And that is when I witnessed something that will haunt me forever. Children were screaming. The teacher was holding a storm trooper as he stood helplessly in the room's only trash can. The apple basin was filled with a rancid smelling rainbow stew of partially digested hummus, veggies, apples and bears.Unfortunately the school does not have windows that open, and a mom was spraying autumn leaf freshener in a futile attempt to cover the stench. At that point the school secretary made the announcement that students should line up in the hallway for the pumpkin parade around the school.As the neighboring classrooms entered the hallway, the smog hit their nose and they began to run. Several second graders slipped in the remaining smears in front of our door. More retching resulted in further contamination of our only exit.We desparately attempted to evacuate the room before more student evacuated their pants. Two of us placed plastic shopping bags over our hands like gloves and passed children through the doorway and over the worst of the wreckage.It was decided that the best course of action at this point was to enact an early dismissal and allow parents an opportunity to take students home. Because the disaster originated in our room, students were quarantined in the gym and not allowed to ride the bus.Our school was closed for two days as kids were tested for a norovirus.  Multiple visits to doctors confirmed the same causation. Irritable bowels from ingestion of sugar substitutes. Fortunately the children recovered quickly than I did.  Forget haunted houses. I pass out every time I see a gummy bear.","upvotes":0,"downvotes":0,"productTitle":"Haribo Sugar Free Gummy Bears 5LB Bag","imageUrl":"http://ecx.images-amazon.com/images/I/51kOw7BMWeL._SY300_QL70_.jpg"}