{"url":"http://www.amazon.com/dp/B000EVQWKC","name":"16_30_95","review":"My grandmother sent me home this Thanksgiving with the usual random tubs, tins, and sandwich baggies of bizarre items.  I was pleased to see a half bag of Hairbo gummy bears in the mix.  Yumm! Sugar free though, but oh well.I was typing out my capstone thesis while watching X-Files re-runs on Netflix, munching away at the bears.  Pretty tasty.  Not overly sweet and good fruity flavors.Later it wasn't so much that something began in my guts, per se; rather, it was like a military grade pipe bomb detonated catastrophically deep within, effectively ground fracking the contents of my person, the entirety of which flooded towards my small, frail, and utterly unprepared, unclenched exit.  Cotton Hanes and luau shorts were not rated for this wrath of Satan.  The pandemonium of my sprint to the toilet may or may not have worsened the situation, but the decision to tumble into the bathtub claimed 3 broken ribs and a bloodied nose.  I was eternally glad for the option to curl fetal, but after 10 minutes I grimly realized that the tub drain was NOT in the open position.  My toes did keep warm, just as I like to arrange for my showers, but this was, in total absolution, not to my liking.  Weeping and sobbing, I greasily kicked the drain and faucet open both.  Time passed.  The horrible spittoon liquid splashed in cresting waves before swirling down the pipes of the home my daughter sleeps in.I needed to tell my mother that I loved her.  My phone, still functional, was within reach, and I blubbered out prayers, piteous confessions, and promises to live as a better man.  I had clearly misdialed to a wrong number, but my message was pure.  I spoke for sons of all nations and across the ages, and this little girl sat as mother for every soldier, sinner, and forsaken soul. She cried with me for a time.  It would be years before she has children of her own, but this was archetypal.  This was bigger than all of us.I woke up with a start. Immediately diarrhea geysered again from my anus.  My phone was ringing; it was my fiancée.  I trembled to answer.  She was in a panic - I didn't question how she could have known my terror.  Instead though, she told me that SHE had to be taken to the ER for a urinary tract infection.  I needed to pick her up.  I considered long and hard simply marrying a different woman.  I flattened an old tarp across the driver area of my sedan and gingerly eased in.  Urgently I sped through red lights, flashing and honking.  None of this was for her sake.  Four blocks from my destination, I realized that I was at T-minus 15 seconds to THE fireblitz of reckoning.  I peeled onto a residential street and left the car running, rolling.  I had the good sense to duck between houses, where I found a darkened back porch.  On this porch was an open cardboard box.  I don't know if that box was empty to begin with, but with no hesitation whatsoever I filled it to the flaps with what could only be called a boiling hot rotten corpse marmalade.  I whimpered as I dabbed at the horrorshow where my bottom button used to be using the only paper I had on hand.  A 20 dollar bill.  Let this review double as an apology to that family, and please accept the gently used Andrew Jackson as yours to keep.Later that night, as I sat swaddled in blankets atop a hotwater bottle, sipping warm broth, the little girl from the bathtub incident called my phone back.  Her concern for a stranger warmed my heart.  I promised to send her a birthday gift.  Yesterday I used Amazon Prime to send a gift purchase just for her.  A 5lb. bag of Haribo Gummy Bears - REGULAR!!!","upvotes":0,"downvotes":0,"productTitle":"Haribo Sugar Free Gummy Bears 5LB Bag","imageUrl":"http://ecx.images-amazon.com/images/I/51kOw7BMWeL._SY300_QL70_.jpg"}