{"url":"http://www.amazon.com/dp/B000EVQWKC","name":"16_30_97","review":"These bears are bad. Very, very bad. I doubted the authenticity of the majority of these reviews so I took it upon myself as a man of science, fueled by curiosity to see for myself how bad these things really were.It's been 15 agonizing hours since the first gummy bear entered my body and I'm typing this from a toilet.It all began when I saw an internet article that pointed me to these reviews, how I rue that day. I laughed for at least an hour at the ridiculous stories, sure they were entertaining, but these so-called \"hell-bears\" as so many reviewers refer to them as couldn't live up to the hype. So, I naturally did what any curious, doubtful person with a lot of free time on their hands would do, I ordered a 5 lb bag.After deriding these sugar free gummy bears to everyone I knew and pointing them to the funny reviews that had no substance I was incredibly excited when I arrived home from the gym and the box was there in front of me, nearly a week before the anticipated arrival date. In retrospect, I realize I should have never taunted the hell bears to arrive so soon, for I was ill prepared.I tore open the package at 6 pm and sat down to enjoy some incredibly delicious gummy bears and watch Netflix. I ate with abandon for 30 minutes straight, even going as far as to fill my mouth with a handle as the timer went off. I figured 30 minutes of eating would be good enough to produce an effect, being a 6'4\" 270 lb strongman competitor I wanted to be sure I ate enough as to leave no doubt. I estimate I consumed around a pound of the bears during that sitting and it was pure bliss, at the time.I sat there for an hour and a half awaiting the proposed inevitable, praying that the stories were true because then it would be funnier than before. Alas, 8 pm rolled around and I had only went to the bathroom once and dropped a very normal stool. I was outraged, after all of these reviews I had tried it for myself and found out that I had been right all along, they were lies! Then, like a well timed retort, my stomach began to growl. It went on for thirty minutes and I hit the bathroom, spewing the remnants of the bears from my sphincter in a very violent fashion. This was the moment in had been waiting for! These bears did the trick, they work, the stories are true!Fast forward to 9 am the next morning and I'm typing this review from a toilet. I didn't sleep, oh I tried, but to no avail. I quit trying to stay hydrated hours ago, everything I drink comes out the other end violently and ceases to stop. I am pooping nothing but water with bits of hell bears in them. I had to cancel my plans last night and stay right next to a toilet, I haven't eaten anything in hours and I've lost 10 pounds. I just want this to be over. I am sorry I ever doubted anything, all of these ridiculous reviews are completely plausible, this is worse than food poisoning. Looking back on the awesome taste and texture of the bears, the experience of eating them that was so good at the time was simply a sick, sadistic taunt. These things are evil, pure evil. Please stay away, these aren't funny or cute, they're from the depths of Hell itself. Please, don't make the same mistake I did, take my word for it and spare yourself the agony that only these hell-bears can produce.And if you do make the same mistake I did, may God have mercy on your soul.","upvotes":0,"downvotes":0,"productTitle":"Haribo Sugar Free Gummy Bears 5LB Bag","imageUrl":"http://ecx.images-amazon.com/images/I/51kOw7BMWeL._SY300_QL70_.jpg"}