{"url":"http://www.amazon.com/dp/B000EVQWKC","name":"16_30_22","review":"I'm pretty sure Andrea (I'll call her) agreed to have dinner at my apartment only because I always spoke to her using nothing but my two-years-of-high-school German.  Her English was perfect.  Probably better than mine.  But the fact that I could only ask her directions to the Autobahn or inquire about the health of her non-existent Tante Amelia, seemed to make me appealing to her in a sweet and non-threatening way.My intentions, however, were considerably less child-like.  Which is why the shopping that night was done at one of those upscale groceries with an international flair.  Moules Marinieres is as much of a panty-peeler as anything I can cook, and isn't that hard to pull off.  But still, I was busy tracking the recipe in my head when I found myself in the sweets aisle.  And that, to my great chagrin, is why I didn't immediately notice the difference between Haribo Normal Gummi Bears (which are designed for human enjoyment) and Haribo Sugarless Gummi Bears (which are designed for use in maximum security prisons as a way to punish uncooperative inmates).I shan't make that mistake again.  (notice you can't spell SHAN'T without SHAT.)Prior to Andrea's arrival, I sat in my living room, creating a playlist of make-out music and nervously binging on the Gummi Bears I had placed in a decorative bowl because I am fancy.The doorbell rang, and within minutes we were standing in the kitchen, drinking beers and both of us probably worrying that we were about to exhaust my ability to communicate in her native tongue.  But soon that would be the least of my worries.  In the middle of trying to ask Andrea if she likes to dance to young people's music, I felt a flutter in my midsection, accompanied by a guttural pronouncement so loud it threatened to drown out my own voice.Maybe it was because I was mentally refreshing my language lessons, but it suddenly struck me how much pre-diarrheal grumblings sound like German words.\"ENTSCHULDIGUNG!\" was the next thing uttered by my rapidly clenching stomach.  Appropriately, Andrea looked up in response.\"Sind Sie Kaffee machen?\" she asked.Am I making coffee?I thought I must have mistranslated her at first, then finally I realized that yes, the loud, ominous gurgling coming from my gut could easily be mistaken for the percolating of some bachelor's crappy coffeemaker.It's remarkable how quickly one knows that one is about to have a traumatic pottymaking experience.  Maybe that's the body's way of buying you the precious seconds you need. I was already calculating the number of steps to the bathroom, speculating on whether I would have time to lift the lid to the toilet, when my own voice cried out loudly in my head.She's going to hear EVERYTHING!Thanks to an acoustical idiosyncrasy in my building, the hallway outside the bathroom works as an amplifier pointed straight at my living room-slash-kitchen.  So that somehow even the gentlest tinkle sounds like I'm pouring lemonade out of a bucket.With only half an idea of what I was doing, I grabbed Andrea's hand and pulled her roughly down onto my sofa.  I must have looked like a madman as I booted up my iTunes playlist, plugged in the gigantic new headphones I had just bought to keep me looking young and hip, and clamped them down over her ears. (the sweat forming on my brow and upper lip couldn't have helped.)  In response to her nervous expression, I kept shouting \"You'll love this!  You'll love this!\"I spun her around so that she was looking out the window.  My \"plan\" was that she'd be so distracted by the modest 4th floor view, that it would allow me to pull my pants off while I sprinted down the hall, silently singing the praises of the noise-reducing quality of my new headphones.  (this story will be reprinted in its entirety as a 5 star review on the Sony Beats Audio Amazon page.)As I slammed the bathroom door shut, already half naked, it occurred to me that I had not been shouting \"You'll love this!\" at Andrea. I don't even know how to say that in German.  In my desperation I had been saying \"Ich Leibe Dich!\" Repeatedly professing my love for her in a shaky and frantic voice.  But maybe that was a good thing, because as I threw myself at the toilet, I figured the best I could hope for is that she would be so creeped-out that she would sneak out of the apartment, blissfully unaware of the carnage taking place in the next room.What can I say about the ensuing white-knuckle bowel movement that hasn't been expressed in other reviews on this page?  I'm pretty sure I haven't seen the adjective \"Kafkaesque\" used anywhere else.By the end of Act One of this private little torture-porn movie, I was confessing to every unsolved crime in history.  Praying I would stumble upon the one that would satisfy my invisible captors.Quickly I realized that I had more than Andrea's sense of sound to worry about.  Were she to get even the faintest whiff of the weapons-grade sluice that my anus was angrily shouting into the porcelain, I would have to change my name and move to another city.And so I flushed.  And flushed.  And flushed and flushed.And then I flushed and nothing happened.I have never looked down into a broken toilet with more horror in my entire life.  And I once stopped up George Clooney's crapper!  (a true story for another time.)I reached for the plunger, but my hand froze and my heart seized when I saw it on the floor, broken in two and covered in what looked like teeth marks.  Apparently I had used the wooden handle to keep from biting my tongue off and had chewed clean through it. When did that happen?  It seems my mind had already started the process of repressing this entire event.Amid the feverish, fruitless dance I did across my tiny bathroom floor, it dawned on me that it had been more than a minute since my last soul-wrenching anal tantrum.  Dear Lord, is it over? I asked, quite possibly aloud.I may have been light-headed and delusional, but I began to imagine a non-ignominious resolution to this ordeal.  I just needed to get her the hell out of here.  If Andrea hadn't fled the building, vomiting in terror, then I supposed I could pull up my trousers and make a cavalier exit.  As long as I could get her off premises and as far away from this post-apocalyptic commode as humanly possible.  Assuming that the Diarrhistas had retreated to the hills temporarily, maybe I could even whisk Andrea away to a candlelight dinner at Bernardo's.  How impulsive!My first few steps back toward the living room were tentative.  And not just because my sphincter felt raw and tattered.  It was a slow approach to the Moment of Truth, especially when I saw her figure still planted on my sofa.  I knew any look on Andrea's face other than her mouth agape would constitute a miraculous victory.  And when she smiled at me, the wash of relief that engulfed me was more glorious than any throes of ecstasy I might have wished for at the beginning of the night.And then I saw it.The decorative bowl sitting in her lap.  Down to just the last few sugarless Gummi bears.\"Du hast Haribo!\" she said to me.  Accompanied by a satisfied smile.  A big, beaming Hansel and Gretel smile, that slightly turned down in one corner at the sound we both suddenly heard.  A low rumble from deep within her GI tract that sounded like Gefahrrrrr.The German word for Danger.Her eyes shot past mine and refocused on the bathroom door just down the hall behind me.","upvotes":0,"downvotes":0,"productTitle":"Haribo Sugar Free Gummy Bears 5LB Bag","imageUrl":"http://ecx.images-amazon.com/images/I/51kOw7BMWeL._SY300_QL70_.jpg"}