{"url":"http://www.amazon.com/dp/B0013D8VDQ","name":"17_30_63","review":"To be honest, this lens has its ups and downs. I’ll obviously the good aspects about this lens, but let’s rewind a bit about my life before this lens came into my life. I am a marketing student, in my final semester of school. I am completing my degree in 2 weeks and planning to move to Harvard for my Masters. As you all know, Harvard MBA fees comes at about $50,000 a semester (books, travel and living expenses excluded). I had no problems financing my studies, since my family had a separate funding account for my studies. On one holy evening, my friend told me about this lens. Being a professional photographer, I was excited and obviously researched for this amazing lens. After looking at the price tag, I had two options. Either to sell my BMW 5-series or use money from my funding for Harvard. Since I won’t be able to carry this lens anywhere without my car, I decided to go with the second option.Once I got the lens, I did some test shots and was able to click photos from across the Canadian border. One day, it just occurred to me what if I could find a location from where I can focus on one of Harvard University’s classrooms and may be record videos and self-educate myself. After months of searching, I finally found the perfect spot on top of a mountain. The amazing part is I have to zoom to complete 500 mm to have a good view. If you plan on doing the same, I would suggest keeping the aperture at f/14-plus since white boards at Harvard are quite big, and you don’t wanna miss the content due to shallow depth of field.Now talking about the bas of this lens. I used to be super active, had six-pack abs and never stayed at home. After this lens, I have been doing most of my work from home. I have shot weddings, events and even baby showers right from my bed. I don’t need to go to school either, since I can focus right from home. Since I can earn money right from home, I am turning rich while laying on bed. This has turned me lazy, fat and inactive. But it feels good, since all this money makes me happy.So guys, there must be bads. But I believed owning this lens has more goods. I saved more than $100,000 dollars from my studies at Harvard by just investing $26,000 on this lens. I get to self-educate myself, don’t have to relocate and don’t have to right s***ty exams. Who knows, once I am done with my MBA from Harvard, I might start doing my Ph.D. right from my bed.","upvotes":0,"downvotes":0,"productTitle":"Sigma 200-500mm f/2.8 APO EX DG Ultra-Telephoto Zoom Lens for Canon DSLR Cameras","imageUrl":"http://ecx.images-amazon.com/images/I/41uAOqLVCOL._SY300_QL70_.jpg"}