{"url":"http://www.amazon.com/dp/B0013D8VDQ","name":"17_30_28","review":"A while back, I was using my Canon 500mm f/4 and realized I needed another stop of light. But how to achieve that? Drop shutter speed to 1/500th? Boost ISO all the way up to 800?In the end, I concluded the only way to get there was to sell the Canon at a loss and spend $20,000 on an f/2.8.They were out of stock, but by paying in advance I was able to convince Sigma to start growing the fluoritecrystal required for the low-dispersion elements back in 2010. The first crystal broke when one of the lab people tuned a radio to AM instead of FM. But they finished growing the second crystal last month and quickly assembled the lens for me. Free shipping was a godsend, as this lens normally is lowered by helicopter and requires at least a quarter acre of land for dropoff.I mostly use it street photography and weddings, plus the occasional boudoir photoshoot.It takes a standard 550mm filter, I was able to attach a closeup filter to bring the minimum focusing distance down to 16 feet. The bokeh is a bit \"nervous\" so for wedding shoots, I sometimes pair this lens with my 500mm f/1.4, which I normally hate to carry because it's a bit bulky at 627 pounds.Autofocus is fast and smooth, and is achieved via a customized car battery. The mechanism is fairly quiet, making it perfect for capturing skittish birds and taking unobtrusive shots in public places. Full-time hug-method manual focus is also available - you simple encircle the lens hood with both arms, bite a corner of the camera with your teeth, and twist your head.All in all I'd say this is an outstanding value, and very cool looking. It works great when shoulder mounted. Try it on government installations, water treatment plants, the white house, and military bases!","upvotes":0,"downvotes":0,"productTitle":"Sigma 200-500mm f/2.8 APO EX DG Ultra-Telephoto Zoom Lens for Canon DSLR Cameras","imageUrl":"http://ecx.images-amazon.com/images/I/41uAOqLVCOL._SY300_QL70_.jpg"}