{"url":"http://www.amazon.com/dp/B0013D8VDQ","name":"17_30_25","review":"First of all, many of you seem to be getting a laugh from the reviews and comments. The intimidation of this lens would probably lead everyone to think its a missile, rather than a piece of photo gear. Though I haven't dished out $30k to buy this, (no average Joe will)I was able to borrow it for a few from a friend's dad, who owns a large photography company in my town. I thought I would give an actual honest review.Alas, it's large. Paraphrase that a bit better -- it's huge. It is virtually impossible to take rewarding photos without a heavy-duty tripod. It weighs about as much as my three year old son does. That being said, this lens is downright outstanding for nature, animal, or sport photographers. I personally used it for scenic photos, and it got the job done in a fashion never thought possible. I was able to take a photo of small birds from great distances in a way that I could see the specks of dirt on their feathers. Keep in mind, its not a considerably long focal range. 200mm in reality is not very long, but when used with a tele-convo, I can take pictures at focal lengths close to 1000mm. All in all, build quality is stellar.When used on my 5D MII and 1D Mark III, I noticed the colors didn't pop as much as my other lenses, in particular the ones apart of the \"L\" series by Canon, but I did notice that this lens works great in a large array of light sources. At a mere f/2.8 or so, you can take pictures without having to worry about low light conditions. Obviously, larger light = clearer pictures.If your looking for a great lens that portrays a great focal range, great build quality, and a nice companion for your (hence) professional photo career, this lens is for you. Its no small cost, obviously you all know that. Besides the cost, there is nothing bad to say about this bad boy. Honestly though, I don't truly recommend this to any hobbyist because I know you all can use the money toward something a little bit more 'down to Earth'. If you make a decent amount of profit from your company, go for it. You won't regret taking the plunge if you do.","upvotes":0,"downvotes":0,"productTitle":"Sigma 200-500mm f/2.8 APO EX DG Ultra-Telephoto Zoom Lens for Canon DSLR Cameras","imageUrl":"http://ecx.images-amazon.com/images/I/41uAOqLVCOL._SY300_QL70_.jpg"}