{"url":"http://www.amazon.com/Joie-Simply-Slice-Strawberry-Slicer/dp/B002451AB2/ref=pd_sbs_79_5/185-5045225-9220526?ie=UTF8&dpID=41ejvDkkEBL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1K17F23KKG7WQENJPQW2","name":"0_15_23","review":"I love kitchen gadgets that make my life a little easier. I was excited to see this strawberry cutter, I buy lots and lots of strawberries at Costco and fruit stands and this seemed like a great tool to help me cut them. It hasn't been as great as I hoped, but still has its uses.I like that all the slices are uniform. This would be great for a dish that you cared about having the same size slices. I made my son a watermelon cake for his first birthday and garnished it with blueberries and strawberry slices. I wish I would've had this to make the strawberry slices look a little better. Since this cuts the strawberries into such small slices it’s perfect for bite size pieces for him. I just use the slicer and cut once more down the middle. It is slightly faster than cutting with a knife, but not markedly.There are a few things I don’t like about it though. First, it’s too dull, making it require a bit of pressure to push through the fruit. I know it’s probably hard finding a healthy medium between safety and having a sharp product. But this could have easily been sharper and it would've made it a little easier. Second, this only fits small-medium strawberries. About 25% of them I got from Costco wouldn't fit in here, mostly due to width. Third, it would've been a better design if it had a tab or lip on the top so it pulled open easier, like my egg slicer. Lastly, I really wish it were dishwasher safe. It takes a few minutes to clean it since there are 7 blades kind of close together that need to be scrubbed.Overall, given the price it’s a decent product. Likely it will go in a back drawer and get used once every few months or when my 10 year old wants strawberries. If I paid any more for it I would be annoyed though. I paid $4.27 for it and now I see it cheaper, so the price does fluctuate a bit. I'm not unhappy I got it, but it's not quite all I was hoping. I did try using it for grapes and grape tomatoes, but unfortunately it mashed them up. Oh, and I forgot to mention, it's really cute!","upvotes":0,"downvotes":0,"productTitle":"Joie Simply Slice Strawberry Slicer","imageUrl":"http://ecx.images-amazon.com/images/I/41ejvDkkEBL._AC_UL160_SR160,160_.jpg"}