{"url":"http://www.amazon.com/The-Mountain-Three-Short-Sleeve/dp/B013M7OI5U/ref=pd_sbs_79_3/185-5045225-9220526?ie=UTF8&dpID=51tuG5qIogL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1K17F23KKG7WQENJPQW2","name":"0_17_45","review":"CAUTION: There seems to be a side-effect that nobody else has discussed, and it seems to be caused by the power of the moon and not the wolves.When I first put on my 4X-Large Three Wolf Moon T-Shirt, I immediately felt extremely \"attractive\" as the energizing power many have described in their reviews coursed through my body. It's hard to explain, but I felt a magnetism and power that seemed to emanate not from the three wolves, but from the moon in the design.After only a few seconds of this overpowering energy surge, I knew something was horribly wrong as I began to feel and notice physical changes to my body. And that's when things started getting weird.The full moon creates a tidal surge across my belly, causing my fat ripples to undulate at an increasing rate, growing larger and more uncontrollable. The slightest movements set off six inch waves that curl and grow as they climb up my body and crash on my shoulders as if they were the shore. Stunned, I collapsed on the couch and generated a tsunami of fat that bruised my face and loosened my front teeth.Now, after a few weeks, small leaves and airborne dust particles seem to swirl around me as if I was standing in the middle of a dust devil. A breeze was enough to keep the orbiting particles away at first, but the strength has been increasing. I now have an orange, Saturn-like debris field of Cheetos at my belt-line and I'm getting nervous as increasingly larger objects get briefly pulled into my gravity field. In fact my brother won't let me near my newborn nephew ever since it got swept up in my rotational field for barely three revolutions before landing safely on the bed. And I caught his pacifier in a net on the first try, so really he only cried for a few seconds.Overall, I do like the fact it comes in my size and it does have a comfortable fit. It handles the six to eight inch waves that can develop without stretching out, and the skin-on-skin, constant lapping near my shoulders is cushioned by the soft cotton fabric. Thank god it didn't have three wolves howling at black hole.","upvotes":0,"downvotes":0,"productTitle":"The Mountain Men's Three Wolf Moon Short Sleeve Tee","imageUrl":"http://ecx.images-amazon.com/images/I/51tuG5qIogL._AC_UL160_SR160,160_.jpg"}