{"url":"http://www.amazon.com/dp/B00032G1S0","name":"5_20_46","review":"One should not be intimidated by Tuscan Whole Milk. Nor should one prejudge, despite the fact that Tuscan is non-vintage and comes in such large containers. Do not be fooled: this is not a jug milk. I always find it important to taste milk using high-quality stemware -- this is milk deserving of something better than a Flintstones plastic tumbler.  One should pour just a small dollop and swirl it in the glass -- note the coating and look for clots or discoloration. And the color -- it should be opaque, and very, very white. Now, immerse your nose in the glass and take a whiff. Tuscan transports you instantly to scenic hill towns in central Italy (is that Montepulciano I detect?) --- there is the loamy clay, the green grass of summer days, the towering cypress.  And those gentle hints of Italian flowers -- wild orchids, sunflowers, poppies. Then, one takes in the thick liquid and lets it roll across and under the tongue -- what is that? perhaps a hint of a nutty Edam cheese?  With Tuscan, you feel the love of every dairyperson involved -- from the somewhat sad and deranged farmhand shovelling steaming cowpies to the bored union milk maiden dreaming of leaving this soul crushing life behind for a job waiting tables for obnoxious American tourists in Siena.  But not too fast -- sip gently, slowly, or one is in danger of not only missing the subtleties of the milk's texture and its terroir, but -- if chilled too long -- also of giving oneself a blinding ice cream headache. Nay, savor the goodness that only dairymen and dairywomen working at the apex of their craft can deliver. Tuscan is best drunk young -- no, no, don't cellar this gem -- I guarantee you'll be sorry if you do.  I recommend pairing with freshly baked macadamia nut scones. Milk Expectorator gives this one a 92.","upvotes":0,"downvotes":0,"productTitle":"Tuscan Dairy Whole Vitamin D Milk, Gallon, 128 oz","imageUrl":"http://ecx.images-amazon.com/images/I/41wKKumJtUL._SY300_QL70_.jpg"}