{"url":"http://www.amazon.com/dp/B003G4IM4S","name":"8_20_58","review":"Is nothing sacred anymore? There are actually crappy knock-offs of the actual Accoutrements / Archie McPhee horse head masks being sold right here on Amazon, and I was one of the victims, so caveat emptor!I purchased this mask along with the Accoutrements squirrel head mask on Feb 18th. The horse mask was sold by Knockout Novelties and Fulfilled by Amazon; the squirrel mask was sold & shipped by Amazon. Both were shipped together & arrived in the same box.The squirrel mask was in a sealed bag, with an Accoutrements / Archie McPhee tag, so I know that item was ok.The horse mask was packed in a flimsy & opened plastic bag, with no tags (other than a bar code label on the bag. It reeked of paint / contact cement. The workmanship was terrible - the hair was not properly glued down, the paint details were missing or poorly done, and it just didn't look right, compared to the tons of pics I've seen. The biggest shock was when I tried to put it on - I could barely get my average sized adult head into it. The neck was also too short  - there was no way it could be tucked into a shirt collar like so many of the pics showed. I relized that this had to be a fake of a fake horse head mask.I wrote Amazon to complain / advise that the seller (Knockout Novelties) was selling fake Accoutrements branded product. As always, Amazon customer service was great, and quickly arranged for the return. I re-orderd a new horse mask, sold & shipped by Amazon this time.The replacement I received is the real thing - sealed bag with the Accoutrements / Archie McPhee tag. Night and day difference in workmanship and detail compared to the fake. This one fits great 9no struggle getting into it), and there is enough 'neck' to be tucked into a collar. It also has a funky contact cement / paint odor, but it's giving me a better buzz than the fake one did.Long story short - this is a fantastic & well made mask, and I can't wait to have fun and start pulling pranks with it! Just make sure you're getting the real Accoutrements / Archie McPhee brand, otherwise you're getting ripped off. I'll be posting some pics of both real & fake masks so others can avoid the heartache.","upvotes":0,"downvotes":0,"productTitle":"Accoutrements Horse Head Mask","imageUrl":"http://ecx.images-amazon.com/images/I/51NhtW9exnL._SX300_QL70_.jpg"}